[
    {"title":"",                         
        "text":""},
    {"title":"Bienvenue",                       
        "text":"Ce guide d'utilisation a pour but de vous fournir une documentation sur l'ensemble des options actuellement implémentées dans PolyDessin. Vous y retrouverez différentes catégories regroupant les sujets importants. Vous pouvez y naviguer grâce au menu de gauche ainsi qu'à l'aide des bouton \"Suivant\" et \"Précédent\"."},
    
    {"title":"Créer un nouveau dessin:",         
        "text":"Grâce à la fenêtre modale \"Créer un nouveau dessin\" vous pouvez créer un nouveau projet vide pour y dessiner. Vous aurez alors l'option de choisir sa taille ainsi que la couleur de son arrière-plan."},
    {"title":"Ouvrir la galerie:",               
        "text":"La galerie vous permettra de visualiser les dessins enregistrés sur le serveur et d'en choisir un pour le continuer ou le modifier."},
    {"title":"Ouvrir le guide d'utilisation:",   
        "text":"Le guide d'utilisation est l'outil que vous utilisez actuellement, il vous permet d'en apprendre plus sur les différents composants de l'application."},
    {"title":"Continuer le dessin:",             
        "text":"Continuer dessin vous permet de charger le dessin sauvegardé dans vos cookies s'il y en a un de disponible, afin de le continuer ou de le modifier."},
    {"title":"Sauvegarde automatique:",
        "text":"Lors de n'importe quel changement apporter à un dessin, ainsi qu'à son ouverture et sa création, une sauvegarde automatique est faite. L'utilisateur pourra donc y accéder via l'option continuer un dessin ultérieurement s'il ferme son navigateur."},
    
    {"title":"Vue dessin:",                      
        "text":"La vue de dessin vous permet d'avoir une interface visuelle vous donnant accès à tout les outils et au dessin sur lequel vous travaillez."},
    
    {"title":"Dessin vectoriel:",                
        "text":"Ce programme utilise des outils de dessin vectoriel, cela veut dire qu'ils ne sont pas définis par des pixels mais par des équations mathématiques plus précises."},
    
    {"title":"Option de fichier:",
        "text":"L'ensemble des options de fichier dont la création d'un nouveau dessin, les options de téléchargement et de sauvegarde se retrouve dans le menu du bas de la bar latérale et sont toujours disponible à l'utilisateur."},
    {"title":"Sauvegarder le dessin:",
        "text":"Il est possible de sauvegarder le dessin en cours sur le serveur en lui donnant un titre et des étiquettes pour y accéder ultérieurement."},
    {"title":"Exporter le dessin:",
        "text":"Il est possible d'exporter le dessin en format SVG, JPEG et PNG. L'utilisateur a aussi l'option d'y ajouter un filtre."},
    
    {"title":"Crayon:",                          
        "text":"Le crayon est l’outil de base du logiciel de dessin. Il ne sert qu’à faire de simples traits sans texture particulière."},
    {"title":"Pinceau:",                         
        "text":"Cet outil est similaire au crayon. Il n’en diffère que par la texture du trait. L’application offre un choix de cinq textures différentes."},
    {"title":"Plume:",
        "text":"L'outil plume permet de faire des tracés avec une pointe en biseau, dont l'utilisateur peut choisir l'angle ainsi que la largeur du biseau. Cette fonctionnalité n’est pas implantée pour l’instant."},
    
    {"title":"Rectangle:",                       
        "text":"L'outil rectangle permet de tracer un rectangle entre le point d'appui de la souris et le point de relâchement. Vous pourrez visualiser votre rectangle avant de relâcher la souris en la déplaçant sur la zone de travail. La touche « Shift » permet de faire un carrée."},
    {"title":"Ellipse:",                       
        "text":"L'outil ellipse permet de tracer une ellipse entre le point d'appui de la souris et le point de relâchement. Vous pourrez visualiser votre ellipse avant de relâcher la souris en la déplaçant sur la zone de travail. La touche shift permet de créer un cercle parfait."},
    {"title":"Ligne:",                           
        "text":"L'outil de ligne permet de dessiner une ligne droite brisée qui reliera chacun des points sur lesquels vous aurez appuyé. La touche « Shift » force l’alignement sur des angles de 45⁰, la touche « Backspace » permet d’effacer le dernier segment et la touche « Espace » permet d’annuler la ligne en cours."},
    {"title":"Étampe:",
        "text":"Cet outil permet de dessiner une des différentes étampes déjà incluses dans l'application et de la manipuler à la guise de l'utilisateur. Cette fonctionnalité n’est pas implantée pour l’instant."},    
    {"title":"Texte:",
        "text":"L'outil texte permet à l'utilisateur d'entrer une chaine de caractère sur le dessin, d'en choisir la taille et d'y navigué pour l'éditer. Cette fonctionnalité n’est pas implémentée pour l’instant."},
    
    {"title":"Couleur:",                         
        "text":"L'ensemble des outils utilisent la couleur sélectionnée et certains, la couleur secondaire. Afin de sélectionner ses couleurs, vous pourriez choisir visuellement une couleur sur la palette de couleurs de l'outil ou entrer manuellement le code hexadécimal correspondant."},
    {"title":"Aplicateur de couleur:",
        "text":"Cet outil permet de changer les couleurs de remplissage et de contour des forme avec respectivement la couleur principal et la couleur secondaire."},
    {"title":"Sceau de peinture:",
        "text":"Permet de créer une zone de couleur remplissant toutes les pixels contigus au pixel de sélection qui partage la même couleur que celle-ci. Il est possible de définir la marge de tolérance d'écart de couleur."},
    {"title":"Efface:",
        "text":"Permet d'effacer les formes du dessin, les formes sont entourées d'une bordure rouge lorsqu’elles sont effaçables."},
    {"title":"Pipette:",
        "text":"Cet outil permet de sélectionner la couleur du pixel sous la souris pour définir la couleur principale avec un clic gauche ou la couleur secondaire avec un clic droit."},    
    
    {"title":"Rectangle de sélection:",
        "text":"Pour effectuer une sélection, un utilisateur pour faire un clic ou un glissé-déposé, l'ensemble des formes comprises dans cette sélection seront encadrées par le plus petit rectangle de sélection possible. Les touches « ctrl.a » permettent de tout sélectionner."},    
    {"title":"Inversion de selection:",
        "text":"À l'aide d'un clic droit, il est possible d'inversé la sélection. Tous les éléments qui n'étaient pas dans la sélection le seront alors et les éléments précédemment sélectionnés seront exclus."},    
    {"title":"Déplacement:",
        "text":"Il est possible de déplacer une sélection à l'aide d'un glisser-déposé partant de cette sélection ou en utilisant les flèches de votre clavier. Si vous utilisez les flèches, la sélection se déplacera de 3 pixels dans la direction désirée."},
    {"title":"Redimensionnement:",
        "text":" -- Implémentation annulé --"},
    {"title":"Rotation:",
        "text":"Permet d’effectuer une rotation sur l'ensemble des éléments de la sélection. La rotation se fait depuis le centre de la zone de sélection ou depuis le centre de chacune des formes si la touche shift est appuyer. La touche « alt » permet de faire une rotation de 1⁰."},
    {"title":"Presse-Papier:",
        "text":"Cet outil permet de copier, de couper ou de coller les différentes sélection grâce au raccourcie clavier et au presse-papier. Les raccourcis sont aussi disponibles dans le menu."},
    
    {"title":"Annuler-Refaire:",
        "text":"Cet outil permet grâce au raccourcie ou aux boutons du menu d'annuler toutes les actions faites par l'utilisateur lors de la session de dessin et de les rétablir par la suite s'il le souhaite."},
    
    {"title":"Grille:",
        "text":"La grille s'affiche par-dessus le dessin et sa taille ainsi que son opacité sont modifiables par l'utilisateur grâce aux raccourcis ou au menu latéral."},
    {"title":"Magnétisme:",
        "text":" -- Implémentation annulé --"},
    
    {"title":"Raccourcis",                         
        "text":"\n - ctrl-O: nouveau dessin\n - ctrl-S: sauvegarder le dessin \n - ctrl-G: voire la galerie\n - ctrl-E: exporter le dessin\n - ctrl-X: couper\n - ctrl-C: copier\n - ctrl-V: coller\n - ctrl-D: dupliquer\n - supprimer: supprimer\n - ctrl-A: tout selectionné\n - ctrl-z:\n - ctrl-shift-z:\n - c: crayon\n - w: pinceau\n - p: plume\n - a: aerosol\n - 1: rectangle\n - 2: ellipse\n - 3: polygone\n - l: line\n - t: text\n - r: applicateur de couleur\n - b: sceau de peinture\n - e: efface\n - d: etampe \n - i: pipette\n - s: selection\n - g: afficher / masquer grille\n - m: magnetisme\n - +: taille des carre +5\n - -: taille des carre -5"}
]
